<a href="https://colab.research.google.com/github/JuniorGunner/DataScienceFormation/blob/master/Pandas/Pandas_Class01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Intro (Classes 01, 02)

In [2]:
import pandas as pd

dados = pd.read_csv("aluguel.csv", sep=";") # Default sep value = ','
dados.head()

                      Tipo           Bairro  ...  Condominio    IPTU
0                Quitinete       Copacabana  ...       500.0    60.0
1                     Casa  Jardim Botânico  ...         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      4020.0  1111.0
3              Apartamento           Centro  ...       390.0    20.0
4              Apartamento     Higienópolis  ...       230.0     NaN

[5 rows x 9 columns]

* Tipo de dados Dataframe:

In [3]:
type(dados)

pandas.core.frame.DataFrame

* Informações do Dataframe:

In [4]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
Tipo          32960 non-null object
Bairro        32960 non-null object
Quartos       32960 non-null int64
Vagas         32960 non-null int64
Suites        32960 non-null int64
Area          32960 non-null int64
Valor         32943 non-null float64
Condominio    28867 non-null float64
IPTU          22723 non-null float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

* Tipos de dados das colunas:

In [6]:
dados.dtypes

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

In [17]:
""" Converting info to dataframe """
tipos_dados = pd.DataFrame(dados.dtypes, columns = ['Tipos de Dados'])
tipos_dados.columns.name = 'Variáveis'
tipos_dados

Variáveis  Tipos de Dados
Tipo               object
Bairro             object
Quartos             int64
Vagas               int64
Suites              int64
Area                int64
Valor             float64
Condominio        float64
IPTU              float64

* Qtd de registros e variáveis:

In [16]:
dados.shape
# dados.shape[0] | dados.shape[1]

(32960, 9)

In [19]:
print("A base de dados apresenta {} registros e {} variáveis.".format(dados.shape[0], dados.shape[1]))

A base de dados apresenta 32960 registros e 9 variáveis.

* Using JSON:

In [21]:
json = open("aluguel.json")
print(json.read())

[{"Tipo":"Quitinete","Bairro":"Copacabana","Quartos":1,"Vagas":0,"Suites":0,"Area":40,"Valor":1700.0,"Condominio":500.0,"IPTU":60.0},
{"Tipo":"Casa","Bairro":"Jardim Bot\u00e2nico","Quartos":2,"Vagas":0,"Suites":1,"Area":100,"Valor":7000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Conjunto Comercial\/Sala","Bairro":"Barra da Tijuca","Quartos":0,"Vagas":4,"Suites":0,"Area":150,"Valor":5200.0,"Condominio":4020.0,"IPTU":1111.0},
{"Tipo":"Apartamento","Bairro":"Centro","Quartos":1,"Vagas":0,"Suites":0,"Area":15,"Valor":800.0,"Condominio":390.0,"IPTU":20.0},
{"Tipo":"Apartamento","Bairro":"Higien\u00f3polis","Quartos":1,"Vagas":0,"Suites":0,"Area":48,"Valor":800.0,"Condominio":230.0,"IPTU":null},
{"Tipo":"Apartamento","Bairro":"Vista Alegre","Quartos":3,"Vagas":1,"Suites":0,"Area":70,"Valor":1200.0,"Condominio":null,"IPTU":null},
{"Tipo":"Apartamento","Bairro":"Cachambi","Quartos":2,"Vagas":0,"Suites":0,"Area":50,"Valor":1300.0,"Condominio":301.0,"IPTU":17.0},
{"Tipo":"Casa de Condom\u00ednio","Bairro":"Barra da Tijuca","Quartos":5,"Vagas":4,"Suites":5,"Area":750,"Valor":22000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Casa de Condom\u00ednio","Bairro":"Ramos","Quartos":2,"Vagas":2,"Suites":0,"Area":65,"Valor":1000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Conjunto Comercial\/Sala","Bairro":"Centro","Quartos":0,"Vagas":3,"Suites":0,"Area":695,"Valor":35000.0,"Condominio":19193.0,"IPTU":3030.0}]

* Impoting to Pandas:

In [25]:
df_json = pd.read_json("aluguel.json")
df_json

   Area           Bairro  Condominio  ...                     Tipo  Vagas  Valor
0    40       Copacabana       500.0  ...                Quitinete      0   1700
1   100  Jardim Botânico         NaN  ...                     Casa      0   7000
2   150  Barra da Tijuca      4020.0  ...  Conjunto Comercial/Sala      4   5200
3    15           Centro       390.0  ...              Apartamento      0    800
4    48     Higienópolis       230.0  ...              Apartamento      0    800
5    70     Vista Alegre         NaN  ...              Apartamento      1   1200
6    50         Cachambi       301.0  ...              Apartamento      0   1300
7   750  Barra da Tijuca         NaN  ...       Casa de Condomínio      4  22000
8    65            Ramos         NaN  ...       Casa de Condomínio      2   1000
9   695           Centro     19193.0  ...  Conjunto Comercial/Sala      3  35000

[10 rows x 9 columns]

* Using TXT:

In [27]:
txt = open("aluguel.txt")
print(txt.read())

Tipo	Bairro	Quartos	Vagas	Suites	Area	Valor	Condominio	IPTU
Quitinete	Copacabana	1	0	0	40	1700	500	60
Casa	Jardim Botânico	2	0	1	100	7000
Conjunto Comercial/Sala	Barra da Tijuca	0	4	0	150	5200	4020	1111
Apartamento	Centro	1	0	0	15	800	390	20
Apartamento	Higienópolis	1	0	0	48	800	230
Apartamento	Vista Alegre	3	1	0	70	1200
Apartamento	Cachambi	2	0	0	50	1300	301	17
Casa de Condomínio	Barra da Tijuca	5	4	5	750	22000
Casa de Condomínio	Ramos	2	2	0	65	1000
Conjunto Comercial/Sala	Centro	0	3	0	695	35000	19193	3030

* Impoting to Pandas:

In [29]:
df_txt = pd.read_table("aluguel.txt")
df_txt

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN
5              Apartamento     Vista Alegre        3  ...   1200         NaN     NaN
6              Apartamento         Cachambi        2  ...   1300       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca        5  ...  22000         NaN     NaN
8       Casa de Condomínio            Ramos        2  ...   1000         NaN     NaN
9  Conjunto Comercial/Sala           Centro        0  ...  35000     19193.0  3030.0

[10 rows x 9 columns]

* Using EXCEL:

In [31]:
df_excel = pd.read_excel("aluguel.xlsx")
df_excel

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN
5              Apartamento     Vista Alegre        3  ...   1200         NaN     NaN
6              Apartamento         Cachambi        2  ...   1300       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca        5  ...  22000         NaN     NaN
8       Casa de Condomínio            Ramos        2  ...   1000         NaN     NaN
9  Conjunto Comercial/Sala           Centro        0  ...  35000     19193.0  3030.0

[10 rows x 9 columns]

* Using HTML:

In [36]:
df_html = pd.read_html("dados_html_1.html")
df_html = pd.read_html("dados_html_2.html")
len(df_html)

3

In [38]:
df_html[0].head()

        Date  ...                                       Reserve balances maintained 4
        Date  ... Balances maintained that exceed the top of the penalty- free band 6
0    Month 7  ...                                            Month 7
1  Apr. 2017  ...                                            2157202
2   May 2017  ...                                            2099222
3  June 2017  ...                                            2076852
4  July 2017  ...                                            2101027

[5 rows x 7 columns]

In [39]:
df_html[1].head()

        Date Reserves  ...               Monetary base
        Date  Total 1  ... Total balances maintained 6 Currency in circulation
0    Month 7  Month 7  ...                     Month 7                 Month 7
1  Apr. 2017  2344812  ...                     2281420                 1540277
2   May 2017  2288936  ...                     2225769                 1548643
3  June 2017  2269683  ...                     2206547                 1556234
4  July 2017  2296929  ...                     2233323                 1562107

[5 rows x 9 columns]

In [40]:
df_html[2].head()

        Date  ... Nonborrowed reserves 1
        Date  ... Nonborrowed reserves 1
0    Month 2  ...                Month 2
1  Apr. 2017  ...                2344767
2   May 2017  ...                2288880
3  June 2017  ...                2269588
4  July 2017  ...                2296763

[5 rows x 7 columns]